## Pandas IO

In [3]:
import pandas # Read pandas package into python
df = pandas.read_csv('C:\\Users\\Student\\tw2330.csv') # read data from tw2330.csv to DataFrame
df.head() # Read the first 5 rows
df.head(10) # Read the first 10 rows

         Date   Open   High    Low  Close    Volume  Adj Close
0  2016-07-28  175.0  176.5  173.0  176.5  31071000      176.5
1  2016-07-27  175.0  176.0  174.5  175.0  34117000      175.0
2  2016-07-26  172.0  173.0  171.5  173.0  32685000      173.0
3  2016-07-25  172.0  173.0  169.0  171.5  27145000      171.5
4  2016-07-22  172.0  172.0  170.5  171.0  28504000      171.0
5  2016-07-21  171.0  172.0  170.0  172.0  33130000      172.0
6  2016-07-20  170.0  170.5  169.0  170.0  38053000      170.0
7  2016-07-19  170.5  170.5  169.0  170.5  42456000      170.5
8  2016-07-18  168.0  170.0  168.0  169.5  24749000      169.5
9  2016-07-15  169.5  169.5  169.5  169.5     41000      169.5

In [6]:
import pandas # Read pandas package into python
df = pandas.read_csv('C:\\Users\\Student\\tw2330.csv', \
                     parse_dates={'Dates': [0]}) # Transform date column into date type
df.head() # Read the first 5 rows
df.head(10) # Read the first 10 rows

       Dates   Open   High    Low  Close    Volume  Adj Close
0 2016-07-28  175.0  176.5  173.0  176.5  31071000      176.5
1 2016-07-27  175.0  176.0  174.5  175.0  34117000      175.0
2 2016-07-26  172.0  173.0  171.5  173.0  32685000      173.0
3 2016-07-25  172.0  173.0  169.0  171.5  27145000      171.5
4 2016-07-22  172.0  172.0  170.5  171.0  28504000      171.0
5 2016-07-21  171.0  172.0  170.0  172.0  33130000      172.0
6 2016-07-20  170.0  170.5  169.0  170.0  38053000      170.0
7 2016-07-19  170.5  170.5  169.0  170.5  42456000      170.5
8 2016-07-18  168.0  170.0  168.0  169.5  24749000      169.5
9 2016-07-15  169.5  169.5  169.5  169.5     41000      169.5

In [ ]:
import pandas
df = pandas.io.data.DataReader(name='2330.TW', data_source='yahoo',start='2000-1-1')

In [52]:
import pandas.io.data as web # as => alias, use "web" to replace pandas.io.data
df = web.DataReader(name='2330.TW', data_source='yahoo',start='2000-1-1')
df.head()

               Open     High      Low    Close     Volume  Adj Close
Date
2000-01-04  83.0813  83.0813  81.6811  83.0813  149083800    29.6180
2000-01-05  83.0813  84.9482  82.1478  84.9482  299016300    30.2836
2000-01-06  84.4815  84.9482  83.0813  83.0813  146768300    29.6180
2000-01-07  80.2809  81.6811  79.3474  80.7476  174796200    28.7861
2000-01-10  83.0813  84.0148  81.6811  83.5480  205184200    29.7844

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4167 entries, 2000-01-04 to 2016-07-28
Data columns (total 6 columns):
Open         4167 non-null float64
High         4167 non-null float64
Low          4167 non-null float64
Close        4167 non-null float64
Volume       4167 non-null int64
Adj Close    4167 non-null float64
dtypes: float64(5), int64(1)
memory usage: 227.9 KB

In [54]:
df.dtypes

Open         float64
High         float64
Low          float64
Close        float64
Volume         int64
Adj Close    float64
dtype: object

In [55]:
df.describe()

,Open,High,Low,Close,Volume,Adj Close
count,4167.000000,4167.000000,4167.000000,4167.000000,4.167000e+03,4167.000000
mean,76.240588,76.940725,75.499032,76.257157,5.530674e+07,60.249221
std,31.072400,31.208413,30.907752,31.083875,3.168548e+08,34.762493
min,32.201900,32.938000,32.109900,32.754000,0.000000e+00,20.446400
25%,55.203200,56.000000,54.500000,55.203300,3.163310e+07,36.601700
50%,63.800000,64.500000,63.100000,63.900000,4.331330e+07,45.676900
75%,89.900000,90.549300,88.950000,90.041300,6.154600e+07,72.942600
max,175.000000,176.500000,174.500000,176.500000,2.040451e+10,176.500000

## DataFrame 可以使用.loc 來篩選資料,格式為: .loc[row,column]

In [57]:
df.loc[df.index >= '2010-01-01' , 'Close'].describe()

count    1688.000000
mean      102.720794
std        31.400658
min        57.200000
25%        74.200000
50%       101.500000
75%       131.000000
max       176.500000
Name: Close, dtype: float64

In [63]:
df.loc[(df.index >= '2008-01-01') &  (df.index < '2010-01-01') ,  'Close'].describe()

count    502.000000
mean      55.984465
std        7.845962
min       36.800000
25%       51.325000
50%       57.600000
75%       62.000000
max       69.400000
Name: Close, dtype: float64

## DataFrame Basic Operation

In [12]:
names = ['Qoo', 'Mary', 'Jane']
height = [180,173,165]
weight = [75,62,55]
print names[0], height[0], weight[0]

Qoo 180 75

In [18]:
import pandas 
df = pandas.DataFrame({'name':names, 'height': height, 'weight': weight})
df

   height  name  weight
0     180   Qoo      75
1     173  Mary      62
2     165  Jane      55

In [29]:
df.loc[0,] # get all basic information of first person

height    180
name      Qoo
weight     75
Name: 0, dtype: object

In [28]:
df.loc[0, 'height'] # get height information of first person

180

In [26]:
df.loc[0, ['height', 'weight']] # get height and weight information of first person

height    180
weight     75
Name: 0, dtype: object

In [27]:
df.loc[0:1, ['height', 'weight']] # get height information of first, and second person

   height  weight
0     180      75
1     173      62